# Index Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TemporaryGraphicsCommandData..::..Index Property
TemporaryGraphicsCommandData Class See Also
---
The unique index of the temporary graphics object managed by TemporaryGraphicsManager.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public int Index { get; internal set; }
```

Visual Basic
---
```text
Public Property Index As Integer
	Get
	Friend Set
```

Visual C++
---
```text
public:
property int Index {
	int get ();
	internal: void set (int value);
}
```

# See Also
TemporaryGraphicsCommandData Class
Autodesk.Revit.UI Namespace